package ua.javarush;

public class TelegramBotContent {       

    public static final String STEP_1_TEXT = """
            <b>ВІТАЄМО НА ПЕРШОМУ РІВНІ!</b>
                                                                  
            Ти прокидаєшся і розумієш, що ти — кіт. Ранок добрий, але що це за дивні відчуття? Твій живіт бурчить від шаленого голоду. Їжі у квартирі немає, хіба що в закритому холодильнику. Що ж робити?
            
            Доведеться згадати, як хакати цифровий холодильник. Відкриваємо книжку "Просунутий хакінг для Котів":
            
                1. Виконай перше завдання, а потім перегорни сторінку!
                2. Прокачайся та переходь до найцікавішого!
                3. Вчини діяння, щоб заслужити повагу серед усіх місцевих котів!
            
            <b>Кіт домашній звичайніус, рівень перший.</b>
            Зламай цифровий холодильник та виконай перше завдання!
            """;

    public static final String STEP_2_TEXT = """
            <b>ВІТАЄМО НА ДРУГОМУ РІВНІ!</b>
                                  
            Юху! Ти здолав холодильник. Ти отримуєш +20 слави!
            
            <i>Накопичено: 20 слави.</i>
            
            Обирай свою нагороду:
            """;

    public static final String STEP_3_TEXT = """
            <b>Кіт Айтішнік, рівень другий.</b>
            Несподівано, з-за кута виповз дзижчащий робот-пилосос. Настав час помсти!
            Виконай друге завдання та зламай його!
            """;

    public static final String STEP_4_TEXT = """
            <b>ВІТАЄМО НА ТРЕТЬОМУ РІВНІ!</b>
                                    
            Ти здолав робопилосос! Ти отримуєш +30 слави!
                                      
            <i>Накопичено: 70 слави.</i>
            
            Обирай свою нагороду:
            """;

    public static final String STEP_5_TEXT = """
            <b>Кіт Робопідкорювач, рівень третій.</b>
            Хо-хо! На шафі виявлений нічийний GoPro!
            Виконай третє завдання — одягни та включи його!
            """;

    public static final String STEP_6_TEXT = """
            <b>ВІТАЄМО НА ЧЕТВЕРТОМУ РІВНІ!</b>
                                    
            Ти одягнув GoPro! Ти отримуєш +40 слави!
                                    
            <i>Накопичено: 140 слави.</i>
            
            Обирай свою нагороду:
            """;

    public static final String STEP_7_TEXT = """
            <b>Кіт Відеоблогер, рівень четвертий.</b>
            Тепер знятий матеріал треба залити на комп'ютер.
            Виконай четверте завдання — зламай пароль від комп'ютера!
            """;

    public static final String STEP_8_TEXT = """
            <b>ВІТАЄМО НА П'ЯТОМУ РІВНІ!</b>
            
            Ти здолав комп'ютер! Ти отримуєш +50 слави!
            
            <i>Накопичено: 230 слави.</i>
            """;

    public static final String FINAL_TEXT = """
            <b>Кіт Хакер, рівень п'ятий.</b>
            День минув не даремно: кіт-хакер вчинив свої діяння та заслужив повагу серед місцевих дворових котів.
            """;
}
